{
	"English": {
		"BURNOUT": "Burnout",
		"CARTRIDGE": "Conventional Cartridge",
		"COMPUTE": "Computed",
		"CONVENTIONAL": "Conventional Gun",
		"CYLINDER": "Cylinder",
		"DOMAIN_LEN": "Length",
		"DOMAIN_TIME": "Time",
		"FOURTEEN_PERF_ROSETTE": "14 Perf. Rosette",
		"FRACTURE": "Fracture",
		"NINETEEN_PERF_CYLINDER": "19 Perf. Cylinder",
		"NINETEEN_PERF_HEXAGON": "19 Perf. Hexagon Prism",
		"NINETEEN_PERF_ROSETTE": "19 Perf. Rosette Prism",
		"NINETEEN_PERF_ROUNDED_HEXAGON": "19 Perf. Rounded Hex. Prism",
		"PEAK_AVG_P": "Peak Average Pressure",
		"PEAK_BREECH_P": "Peak Breech Pressure",
		"PEAK_SHOT_P": "Peak Shot Base Pressure",
		"PEAK_STAG_P": "Peak Stagnation Pressure",
		"RECOILLESS": "Recoilless Gun",
		"SAMPLE": "Sampled",
		"SEVEN_PERF_CYLINDER": "7 Perf. Cylinder",
		"SEVEN_PERF_ROSETTE": "7 Perf. Rosette Prism",
		"SHOT_EXIT": "Shot Exit",
		"SHOT_START": "Shot Start",
		"SOL_LAGRANGE": "Lagrange ∂ρ/∂x = 0",
		"SOL_MAMONTOV": "Mamontov ∂T/∂x = 0",
		"SOL_PIDDUCK": "Pidduck  ∂S/∂x = 0",
		"SPHERE": "Sphere",
		"STRIP": "Strip / Flake",
		"TELESCOPED": "Telescoped Cartridge",
		"TUBE": "Tube",
		"TvDesc": "Adb.Temp",
		"USE_CV": "Use Chamber Volume",
		"USE_LD": "Use Load Density",
		"USE_LF": "Use Load Fraction",
		"afLabel": "Autofrettage",
		"ambGamLabel": "Adiabatic Index",
		"ambPresLabel": "Ambient Pressure",
		"ambRhoLabel": "Ambient Density",
		"ammoLabel": "Chamber Length",
		"arcLabel": "Web",
		"arcText": "Propellant's web is the shortest normal measure between two non-adjacent surfaces of the propellant grain. Value is intended to represent lot median. \n This is the primary determinant for rapidity of combustion process, the peak pressure reached and the location of the burn-out point.",
		"atmISPDesc": "Isp(Atm)",
		"atmosLabel": "Aerodynamic Drag",
		"auxFrmLabel": "Bore Trace",
		"auxGrainFrmLabel": "Auxiliary Charge",
		"auxMassRatio": "Mass Aux / Main",
		"auxText": "Pressure acting on the bore from the chamber to muzzle, colored to the average gas temperature.",
		"auxWebRatio": "Web Aux / Main",
		"beffLabel": "Ballistic Efficiency",
		"beffText": "Ballistic efficiency of the gun system denotes the amount of work done the projectile over potential work of propellant.",
		"bopLabel": "Burnout Point",
		"brDesc": "Burnrate",
		"breech": " Breech",
		"calLabel": "Caliber",
		"calLxText": "Caliber length of the bore, as measured from the start of travel (top) or breech face (bottom).",
		"calcButtonText": "Integrate system using RKF7(8) integrator",
		"calcLabel": "Solve Gun",
		"cancelMsg": "File Operation Was Canceled",
		"chgLabel": "Charge Mass",
		"chgText": "Mass of propellant charge to be used. For ratio of charge to mass much less than 1, the model used is decently accurate. Empirically, calculated results for a charge to mass ratio of close to 1 (e.g. US M829A1) is also reasonably close. For ratio greater than 1, calculated result is an underestimation of shot velocity. To date, the highest charge to mass gun to be fielded is that of the German 380mm Paris Gun, at ~2-2.5.",
		"clrLabel": "Chambrage Ratio",
		"clrText": "Chambrage ratio, or the average cross section of chamber over that of the barrel.\n Given the density of propellant is much less than that of the shot, having chamber that is wider than the barrel improves cartridge packaging. This an increase in speed of gasses as it flows from the chamber into the barrel, most prominently at the beginning of the internal ballistic cycle.\n For conventional gun, the chambrage effect is corrected by averaging the influence of chambrage over the length of barrel and increasing the secondary work factor by a corresponding amount. For recoilless gun, due to the slow velocity of shot and low pressure, the chambrage effect is not corrected for.",
		"columnList": {
			"CONVENTIONAL": [
				"Event",
				"Time",
				"Travel",
				"Burnup",
				"Velocity",
				"Breech P.",
				"Avg. Pres.",
				"Shot Pres.",
				"Avg. Temp."
			],
			"RECOILLESS": [
				"Event",
				"Time",
				"Travel",
				"Burnup",
				"Outflow F.",
				"Velocity",
				"Outflow V.",
				"Lock Pres.",
				"Stag. Pres.",
				"Avg. Pres.",
				"Shot Pres.",
				"Avg. Temp."
			]
		},
		"consButton": "Constrain Design",
		"consFrmLabel": "Constraints",
		"cvLabel": "Chamber Volume",
		"cvlfLabel": "Load Condition",
		"cylLRText": "Specify length to diameter ratio of the grain.",
		"darkLabel": "Dark",
		"dataLabel": "Data",
		"debugLabel": "Debug",
		"densityDesc": " Density",
		"designLabel": "Design",
		"dgcLabel": "Resistance Factor",
		"dgcText": "Resistance factor models all resistive forces as a fraction of the shot base pressure.\n 2%-7% has been reported, value is higher for small arm bullets which deforms the jacket to engage with rifling, lower end for large caliber shells with driving bands.",
		"diaText": "Specify the diameter of propellant grain.",
		"diamLabel": "Diameter",
		"enableLabel": "Enabled",
		"envFrmLabel": "Environment",
		"errFrmLabel": "Exceptions",
		"errorTab": "Exceptions",
		"excTitle": "Error",
		"exportAux": "Export Bore Trace",
		"exportGeom": "Export Form Function",
		"exportGuide": "Export Guide Graph",
		"exportLabel": "Export Table as CSV",
		"exportMain": "Export Main Plot",
		"figAuxDomain": "Distance to Breech - m",
		"figAvgP": "Space Mean\nPressure\nMPa",
		"figBreech": "Breech\nPressure\nMPa",
		"figLenDomain": "Travel - m",
		"figNozzleP": "Lock Pressure\nMPa",
		"figNozzleV": "Outflow Velocity\nat Throat\nm/s",
		"figOutflow": "Outflow Fraction",
		"figPsi": "Burnup Fraction",
		"figRecoil": "Recoil\nMN",
		"figShotBase": "Shot Base\nPressure\nMPa",
		"figShotVel": "Shot Velocity\nm/s",
		"figStagnation": "Stagnation\nPoint Pressure\nMPa",
		"figTgtP": "Pressure Target",
		"figTgtV": "Velocity Target",
		"figTimeDomain": "Time - ms",
		"force": "   Force",
		"geomPlotText": "Plot of the form function, or the normalized surface area (σ) with respect to (normalized) depth of combustion (Z). Positive slope indicate progressive burning and vice versa for regressive burning. Discontinuity indicate fracture of mutli-perforated propellant.\n Form function used is cubic pre-fracture and quadratic post-fracture, the latter is approximate.",
		"gmLabel": "Tube Mass",
		"grainFrmLabel": "Grains",
		"guideBVTitle": "Bore Volume - L",
		"guideBurnoutTitle": "Relative Burnout Point - Burnout Point / Travel",
		"guideCMDomain": "Charge Mass - kg",
		"guideCtrlFrmLabel": "Guidance Parameter",
		"guideFrmLabel": "Guide Diagram",
		"guideLDDomain": "Load Density - kg/m",
		"guideLabel": "Make Guide Diagram",
		"guidePlotBurnout": "Burnout Point Contour",
		"guidePlotTravel": "Travel Contour",
		"guidePlotVolume": "Bore Volume Contour",
		"guideTab": "Guidance",
		"guideTravelTitle": "Travel - m",
		"heightRText": "Specify the height to width ratio of propellant rod or flake.",
		"htwLabel": "Height / Width",
		"insetLabel": "Maximum Inset",
		"isochorDesc": "(Isochoric)",
		"ldLabel": "Load Density",
		"ldfLabel": "Load Factor",
		"ldfText": "Percentage of chamber volume filled by the propellant, limited by packing behaviour of grains.",
		"lightLabel": "Light",
		"loadLabel": "Load Gun",
		"loadPresetLabel": "Load Presets",
		"lockButton": "Constrain Travel",
		"lockText": "Respect the user specified travel during constrained solving, in lieu of the velocity target. This option is mutually exclusive with minimum chamber volume optimization.",
		"ltarcLabel": "Length / Web",
		"ltarcText": "Specify the length to web ratio for tubular propellant.",
		"ltdLabel": "Length / Diameter",
		"ltwLabel": "Length / Width",
		"lxLabel": "Travel",
		"matDensityLabel": "Material Density",
		"matFrmLabel": "Structural Material",
		"matYieldLabel": "Yield Strength",
		"maxCMRLabel": "Max Charge / Shot Mass",
		"maxGuessLabel": "Max Guess",
		"maxIterLabel": "Max Iteration",
		"maxLFLabel": "Max Load Fraction",
		"maxLgLabel": "Max Length",
		"mean": "  Mean ",
		"minCMRLabel": "Min Charge / Shot Mass",
		"minLFLabel": "Min Load Fraction",
		"minTVButton": "Minimize Total Volume",
		"minWebLabel": "Minimum Web",
		"mvLabel": "Muzzle Velocity",
		"nameFrm": "Design Overview",
		"noDataMsg": "Invalid Design or Data",
		"nozzEffLabel": "Nozzle Efficiency",
		"nozzEffText": "Efficiency of nozzle for recoilless gun. From rocket theory, it is possible to construct nozzle of decent efficiency (as high as 95%) using simple geometries, for example a straight walled truncated cone with a 15 deg half angle. Covolume correction is unnecessary due to the low pressure involved in its internal ballistics, which is on the order of rocket engines.\n Nozzle Efficiency is introduced to account for geometrical inefficiencies, wear as would be expected from a service weapon, and finally to average out the effect of muzzle thrust factor increasing as the projectile leaves the tube.\n Typically taken to be around 92%, this implies that an actual recoilless gun will tend to slightly recoil forward while projectile is in bore, and backward after it has left.",
		"nozzExpLabel": "Expansion Ratio",
		"nozzExpText": "Nozzle expansion ratio of the recoilless gun's rear nozzle, or the cross section of the nozzle end over that of the throat. This is used to size the throat to achieve recoilless condition while the projectile is still in bore.\n Usually taken to be 2-4. Higher expansion ratios are only marginally more efficient while incurring additional penalty to weight.",
		"opFrmLabel": "Operations",
		"optLFText": "Find the optimum load fraction for given charge mass, minimizing the total volume of the bore and chamber, under the constraint set out above.\n Verify the burnout point is reasonably deep in-bore, as propellant burn rate is sensitive to the ambient temperature and varies from lot to lot. A deeply contained burnout-point yields overall better muzzle velocity consistency, which is more of a concern for indirect fire guns as compared to direct fire guns. On direct fire guns, some sacrifice in this area is required to allow powerful ballistics within a compact package.",
		"pHTgtLabel": "High Chamber",
		"pLTgtLabel": "Low Chamber",
		"pPLabel": "Peak Pressure",
		"pRatioDesc": "          (Pc:Pa=50)",
		"pTgtLabel": "Pressure Target",
		"pTgtText": "Pressure target, imposed at the characteristic point selected in the drop down menu.",
		"paLabel": "Peak Acceleration",
		"parFrmLabel": "Parameters",
		"pdtarcLabel": "Perf. Diam. / Web",
		"pdtarcText": "Specify diameter of perforation over propellant web.\n Multiple-perforated propellant can be made either via casting or extrusion, both processes relies on copper die to shape the perforation.",
		"peffLabel": "Piezo Efficiency",
		"peffText": "Piezoelectric efficiency of the gun system, i.e. the ratio of average pressure to peak pressure. Higher value indicate more efficient utilization of tube length.",
		"perfLRText": "Specify length to diameter ratio of the grain.\n higher value leads to progressive burning, but induce higher mechanical stress onto grains leading to premature fracture. A value too low means propellant primarily burns along the  axial direction, exhibiting regressive burning behaviour",
		"plotAvgP": "Space Mean Pressure",
		"plotBaseP": "Shot Base Pressure",
		"plotBreechP": "Breech Pressure",
		"plotBurnup": "Burnup Fraction",
		"plotEtaEsc": "Outflow Fraction",
		"plotFrmLabel": "Plot",
		"plotHighP": "High Chamber Pressure",
		"plotLowAvgP": "L.C. Mean Pressure",
		"plotNozzleP": "Lock Pressure",
		"plotNozzleV": "Outflow Velocity",
		"plotRecoil": "Recoil",
		"plotStagP": "Stagnation Pressure",
		"plotTab": "Plotted Data",
		"plotText": "Considerable difficulty exist for modelling the mixed-phase flow of burning propellant and gas. Therefore simplification is commonly adopted in the works of interior ballisticians. First, solid particulate is assumed to be comoving with gas at the same velocity, simplifying to a homogeneous flow model. Second, the spatial distribution of gas properties is assumed through varying simplifying assumptions, allowing parameters to be appropriately treated as a constants, simplifying calculations.\n The Lagrange approximation is the classical (and most common) solution used. Adopting the assumption that gas density is constant (∂ρ/∂x = 0), gas velocity is found to be linearly distributed, and pressure, quadratically. Pidduck merely assumed isentropic (∂S/∂x = 0) expansion from uniform initial condition, calculating in detail the wave systems generated as shot starts after the complete combustion of propellant gas, which was found to also imply a linear velocity distribution, but exponentially distributed pressure, in the limit of weak perturbations. The M.A.Mamontov (Ма́монтов) solution is the limiting solution to the Pidduck approximation as adiabatic index approaches 1, implying an even temperature distribution (∂T/∂x = 0), with a similar distribution to that of Pidduck's.\n The validity of Lagrange's approximation can be explained by, as the charge to (fictitious, adjusted for drag and friction) mass ratio is very small, any pressure disturbances, propagating as waves, would reflect many times between shot base and breech face, tending to equalize the density spatially. However, as charge to mass increase, it is increasingly difficult for the reflected wave to catch up to shot, invalidating the underlying assumption.\n The Pidduck approximation accounts for the aforementioned wave phenomena, and represents the limiting behaviour when the rarefaction waves are quickly damped, which is not necessarily true at higher charge to shot ratio, and finite rate or combustion, which could generate shock waves due to ignition instabilities.\n The Mamontov approximation is considered by some to be best suited to the case of high charge to weight, given that temperature tends to equalize more readily.\n In practice, the solution arrived at using any of the above approximation is quite close. None of these assumptions captures the increased unevenness as charge to weight exceeds 1. To model that case would require multi-phase, multi-dimensional models that are well outside the scope of this program. Nevertheless for conventional designs the classical approach should well suffice.",
		"plotVel": "Shot Velocity",
		"pltOptnFrm": "Plot Option",
		"ppLabel": "Peak Pressure",
		"ppText": "Peak pressure includes maximum average pressure, and the maximum breech pressure.",
		"propFrmLabel": "Propellant",
		"reloadPropellant": "Reload Propellant",
		"resetLabel": "Reset Gun",
		"sampText": "The domain to sample equidistantly form shot start until projectile exit.\n PIBS first solves the characteristic points, controlling for error. Then, the projectile's history is sampled equidistantly along the specified domain. Significant discontinuity between the two usually indicates insufficient accuracy specification, in which case the sample amount should be reduced, and the accuracy specification increased.",
		"sampleFrmLabel": "Sampling Points",
		"saveLabel": "Save Gun",
		"savedLocMsg": "Saved File As",
		"segmentLabel": "Segments",
		"sffLabel": "Safety Factor",
		"shtLabel": "Shot Mass",
		"solFrmLabel": "Gas Gradient",
		"solLabel": "Solution",
		"specFrmLabel": "Specification",
		"specsText": "Specify the propellant composition used.\n Pure Nitrocellulose is dissolved into a suitable organic solvent, acetone for example, causing microscopic swelling, reducing the burn rate by ~10^5, from detonation to burning, or exothermic decomposition in absence of air, making it suitable for use as propellant. Nitration level from 11%-13% is possible. Stabilizer that improve chemical stability can be added as well, forming single based propellant. These have excellent mechanical strength, low cost and high availability.\n Double based propellant is formed when energetic Nitroglycerin is used as gelatinizer instead. While more energetic and less sooty, it also burns hotter and erodes barrel more. DEGDN can be substituted at the cost of thermal stability if supply of NG is unavailable.\n Triple base propellants primarily consist of Nitroguanidine, improving combustion chemistry, when mixed with conventional propellant, generating higher energy content while keeping flame temperature low. However, it is mechanically the weakest, and Nitroguanidine availability is limited. Mixed Nitrate Ether propellants are available that delivers similar level of performance with higher availability.\n Nitramine propellants mix nitramines like RDX or HMX with small fraction of organic nitro propellant. Nitramines are normally explosives, but their burn characteristic can be modified for use as propellant by grounding to micrometer sized particles. HMX is preferable to RDX in terms of propellant force, but burn less controllably. Nitramine propellants tends to be considerably erosive.",
		"stepCMRLabel": "Charge / Shot Mass Step",
		"stepLFLabel": "Load Fraction Step",
		"stepLabel": "Steps",
		"stpLabel": "Start Pressure",
		"stpText": "Starting Pressure, parameter used to model projectile engraving to simply internal ballistic solutions.\n The engraving process is often simplified to be instantaneous. That is, propellant burns in an isochoric fashion until the pressure at base of projectile is enough to overcome starting pressure, at which point starting pressure vanish.\n Historically start pressure was determined as the highest pressure recorded when a projectile is pressed down into the barrel. Although a higher start pressure somewhat increase the peak pressure, a certain level of initial resistance is necessary for consistency of ignition.\n In reality, projectile obturation is a dynamic process, done at some speed.",
		"stripRText": "Specify length to width ratio of propellant rod or flake.",
		"sucTitle": "Success",
		"swapLabel": "Swap Main/Aux",
		"tableTab": "Tabular Data",
		"tblFrmLabel": "Result Table",
		"tblLabel": "Travel",
		"teffLabel": "Thermal Efficiency",
		"teffText": "Thermal efficiency of the gun system, i.e. the amount of work done to both gas and projectile over potential from propellant. This is equivalent to 1 subtracting the average temperature of exhaust gas with that of its adiabatic flame temperature.",
		"themeLabel": "Theme",
		"tolText": "The maximum tolerated error, ε, for each component of the integrands\n The absolute difference between the 8th order estimate and the 7th order estimate, as constructed from the Runge-Kutta- Fehlberg 7(8) method, is taken to be the local truncation error. This is scaled by the ratio between integration range and step- size to estimate global truncation error. Finally, this is divided by the current value for each integrand to to derive the relative error.\n The exact error criteria is constructed such that for values between (0,1) the maximum allowed error is exactly ε, and for higher values x, ε*x. The underlying SoE is expressed in scaled unitless formulation, i.e. with scaled velocity from [0,1) and scaled length & time (0,+inf).\n Default value corresponds to ε=1e-3, if value discontinuities appear, or if constrained solving fail to match target, increase this value conservatively, computation time greatly increase with this.",
		"traceHull": "Tube Trace",
		"tracePress": "Pressure Trace",
		"typeLabel": "Gun Type",
		"uncontained": "Uncontained",
		"useAuxGrainLabel": "Mixed Charge",
		"useConsText": "Solve web and barrel length corresponding to peak pressure and muzzle velocity targets at the specified accuracy.",
		"useMaterialLabel": "Calculate Structure",
		"vTgtLabel": "Velocity Target",
		"vaLabel": "Asymptotic Velocity",
		"vacISPDesc": "Isp(Vac)",
		"vinfText": "Velocity the shot would achieve if the barrel is extended to infinite length, or equivalently, if the gas is allowed to expand to temperature of absolute zero.",
		"widthLabel": "Width",
		"widthText": "Specify the width of propellant strip or flake."
	},
	"中文": {
		"BURNOUT": "火药燃尽",
		"CARTRIDGE": "常规弹药",
		"COMPUTE": "计算点",
		"CONVENTIONAL": "常规火炮",
		"CYLINDER": "圆柱",
		"DOMAIN_LEN": "空间",
		"DOMAIN_TIME": "时间",
		"FOURTEEN_PERF_ROSETTE": "花边十四孔柱",
		"FRACTURE": "火药分裂",
		"NINETEEN_PERF_CYLINDER": "圆柱形十九孔柱",
		"NINETEEN_PERF_HEXAGON": "正六边形十九孔柱",
		"NINETEEN_PERF_ROSETTE": "花边十九孔柱",
		"NINETEEN_PERF_ROUNDED_HEXAGON": "圆角六边形十九孔柱",
		"PEAK_AVG_P": "最大平均压强",
		"PEAK_BREECH_P": "最大膛底压强",
		"PEAK_HIGH_P": "最大高压室压强",
		"PEAK_SHOT_P": "最大弹底压强",
		"PEAK_STAG_P": "最大滞流点压强",
		"RECOILLESS": "无后坐炮",
		"SAMPLE": "采样点",
		"SEVEN_PERF_CYLINDER": "圆柱形七孔柱",
		"SEVEN_PERF_ROSETTE": "花边形七孔柱",
		"SHOT_EXIT": "弹头离膛",
		"SHOT_START": "弹头启动",
		"SOL_LAGRANGE": "拉格朗日解 ∂ρ/∂x = 0",
		"SOL_MAMONTOV": "马蒙陀夫解 ∂T/∂x = 0",
		"SOL_PIDDUCK": "毕杜克解   ∂S/∂x = 0",
		"SPHERE": "球体",
		"STRIP": "带状",
		"TELESCOPED": "（半）埋头弹药",
		"TUBE": "管状",
		"TvDesc": "绝热燃烧温度",
		"USE_CV": "按药室容积计算",
		"USE_LD": "按装填密度计算",
		"USE_LF": "按装填系数计算",
		"afLabel": "炮管自紧",
		"ambGamLabel": "绝热系数",
		"ambPresLabel": "环境压强",
		"ambRhoLabel": "环境密度",
		"ammoLabel": "药室实际长度",
		"arcLabel": "弧厚",
		"arcText": "   设置火药药粒的弧厚。弧厚又称肉厚、燃烧层厚度。对于简单火药，为平行表面间最短的距离；对于多孔火药，是相邻两孔内表面间最短距离、也是最外层孔的内表面与药粒外表面间的最短距离。内弹道假设火药所有表面同时点火，以各向同速的平行层燃烧。其他条件一定的条件下，肉厚对燃烧过程起到调速作用，控制最大压强的大小、燃烧结束点的位置。\n   多孔火药的加工精度一般在0.15mm-1um之间，因此通常弧厚不可过小，否则批次间差距过大，不利于保证一致性。简单形状火药相对而言可以加工，筛选成更小的几何尺寸。因此，在小口径武器或无坐力炮等需要较小尺寸药粒的情况下通常使用简单形状药粒。",
		"atmISPDesc": "　　大气比冲",
		"atmosLabel": "计算弹前空气阻力",
		"auxFrmLabel": "炮膛曲线",
		"auxGrainFrmLabel": "混合装药参数",
		"auxMassRatio": "质量比",
		"auxText": "膛内压强示意图，各条压强曲线对应采样点，按平均气体温度着色。应注意，压强分布按分段拉格朗日计算，无视特征点计算所选择的具体分布。",
		"auxWebRatio": "弧厚比",
		"beffLabel": "弹道效率",
		"beffText": "火炮弹道效率（γg）定义为热机效率除以次要功系数（φ），即γg=γg'/φ，也是炮弹出膛动能占火药做功潜能的比例，是衡量火炮系统火药利用效率的主要指标之一。",
		"bopLabel": "燃尽点相对位置",
		"brDesc": "燃速",
		"breech": " 膛底",
		"calLabel": "口径",
		"calLxText": "身管倍径，即将火炮身管长度表述为口径的倍率\n上为从运动起点记，下为从炮膛膛底计。",
		"calcButtonText": "调用龙格-库塔-菲尔伯格7-8阶积分器求解系统。",
		"calcLabel": "求解火炮",
		"cancelMsg": "已取消",
		"chgLabel": "药量",
		"chgText": "内弹道系统的极限弹速正比与装药质量与火药力的乘积的平方根，因此使用更高的装药量与换用药力更高的火药都对于提高弹速具有积极作用。装药量与通过乘以（1+阻力系数）调整的等效弹重系数的比例称为装药比。程序使用的经典内弹道系统对于装药比<1的情况适用。经验表明，计算结果对于装药比接近1（如美M829A1脱壳尾翼稳定穿甲弹）的仍然比较准确。历史上在常规火炮中实用过的最大装药比约为2到2.5（德380mm“巴黎大炮”）。>1的高装药比下计算结果倾向于低估弹速，仅作为参考。",
		"clrLabel": "药室扩大系数",
		"clrText": "药室扩大系数指的是药室截面积与炮管截面积的比例。膛压较大时，定装弹药过长的药室存在抽壳困难的情况，后膛过长也不利于火炮装填作业，并造成点火困难。\n药室缩进产生流速突变对于弹道内循环的起始阶段影响最大。这里按照坡膛面积、流速突变考虑，对于常规火炮，以修正次要功系数的方法体现这样的效应。对于无坐力炮，由于涉及压强弹速较低，未对缩进效应进行修正。",
		"columnList": {
			"CONVENTIONAL": [
				"特征点",
				"历时",
				"行程",
				"火药燃去比例",
				"弹速",
				"炮膛膛底压强",
				"空间平均压强",
				"弹药弹底压强",
				"平均燃气温度"
			],
			"RECOILLESS": [
				"特征点",
				"历时",
				"行程",
				"火药燃去比例",
				"弹速",
				"喷口燃气流速",
				"药室底压强",
				"滞止点压强",
				"空间平均压强",
				"弹药弹底压强",
				"平均燃气温度",
				"燃气流出比例"
			]
		},
		"consButton": "反算弧厚行程",
		"consFrmLabel": "反算设置",
		"cvLabel": "药室容积",
		"cylLRText": "设置、管柱状火药的长径比",
		"darkLabel": "深色",
		"dataLabel": "数据",
		"debugLabel": "调试信息",
		"densityDesc": "　　　　密度",
		"designLabel": "设计",
		"dgcLabel": "阻力系数",
		"dgcText": "膛内阻力，按与弹底压强的比例计算。对于线膛武器，取值从2%到7%不等，其中小口径武器相对较高。",
		"diaText": "设置火药药粒的直径。",
		"diamLabel": "直径",
		"enableLabel": "启用",
		"envFrmLabel": "大气参数",
		"errFrmLabel": "程序运行例外",
		"errorTab": "运行例外",
		"excTitle": "错误",
		"exportAux": "导出炮膛曲线",
		"exportGeom": "导出形状函数图",
		"exportGuide": "导出指导图",
		"exportLabel": "导出表格",
		"exportMain": "导出计算结果图",
		"figAuxDomain": "膛底距离 - m",
		"figAvgP": "平均压强\nMPa",
		"figBreech": "膛底压强\nMPa",
		"figLenDomain": "行程 / m",
		"figLowAvgP": "低压室平均压强\nMPa",
		"figNozzleP": "药室底压强\nMPa",
		"figNozzleV": "喷管喉速\nm/s",
		"figOutflow": "流出比例",
		"figPsi": "燃去比例",
		"figRecoil": "后坐力\nMN",
		"figShotBase": "弹底压强\nMPa",
		"figShotVel": "弹速\nm/s",
		"figStagnation": "滞止点压强\nMPa",
		"figTgtP": "设计压强",
		"figTgtV": "设计弹速",
		"figTimeDomain": "时间 / ms",
		"force": "　　　火药力",
		"geomPlotText": "相对燃烧表面σ=S/S1，关于相对厚度Z=e/e1的函数。曲线递增代表增面燃烧，曲线递减代表减面燃烧。简单形状火药燃烧全过程Z从0到1，为减面燃烧；多孔火药的燃烧分裂前Z从0到1，有条件地增面燃烧，分裂后Z从1到Zb，由于剩余体积较小，分裂出棒状体几何形状复杂，以等体积圆柱处理，燃烧体现减面性。增面燃烧的药形有利于减缓压强上升，降低最大压强，提高压强充满率，改善膛内受力情况。",
		"gmLabel": "身管质量",
		"grainFrmLabel": "药粒参数",
		"guideBVTitle": "膛内容积 - L",
		"guideBurnoutTitle": "相对燃尽点位置 - 燃尽点 / 行程",
		"guideCMDomain": "装药量 - kg",
		"guideCtrlFrmLabel": "指导图参量",
		"guideFrmLabel": "指导图",
		"guideLDDomain": "装填密度 - kg/m",
		"guideLabel": "计算指导图",
		"guidePlotBurnout": "燃尽点图",
		"guidePlotTravel": "行程图",
		"guidePlotVolume": "膛容图",
		"guideTab": "指导图",
		"guideTravelTitle": "行程 - m",
		"heightRText": "设置火药的高宽比例。",
		"htwLabel": "高宽比",
		"insetLabel": "最大弹头缩进量",
		"isochorDesc": "（定容）",
		"ldLabel": "装填密度",
		"ldfLabel": "装药系数",
		"ldfText": "装填系数，等于装填密度(Δ)与火药密度(ρp)的比例。该系数反应了药室内药包，药筒，组合模块等装药结构、药粒真实堆叠对于空间的利用效率。过低的装填系数可能造成火药出现低压异常燃烧现象，严重情况下无法克服挤进压力将弹头推出炮管。过高的装填系数装填时可能需要用力挤压，使药粒变形碎裂；在击发时也难以保证传火效率，无法均匀点火，在大装药量下还容易诱发燃烧压力波。经验上，小口径武器由于药粒形状简单，装药量小，可以采用较大的装填系数。装药量大，采用多孔火药的大口径武器，装填系数普遍较低。",
		"lightLabel": "浅色",
		"loadLabel": "读取设计",
		"loadPresetLabel": "读取预设",
		"lockButton": "锁定行程",
		"lockText": "按设定的行程，作压强符合计算，忽略设定的弹速目标。该选项与最小膛容解计算互斥。",
		"ltarcLabel": "药长弧厚比",
		"ltarcText": "设置管状火药药长弧厚比。",
		"ltdLabel": "药粒长径比",
		"ltwLabel": "长宽比",
		"lxLabel": "身管长",
		"matDensityLabel": "材料密度",
		"matFrmLabel": "结构材料",
		"matYieldLabel": "屈服强度",
		"maxCMRLabel": "最大装药:弹重比",
		"maxGuessLabel": "随机采样数",
		"maxIterLabel": "缩颈迭代数",
		"maxLFLabel": "最大相对装填密度",
		"maxLgLabel": "最长行程",
		"mean": " 平均",
		"minCMRLabel": "最小装药:弹重比",
		"minLFLabel": "最小相对装填密度",
		"minTVButton": "求最小膛容解",
		"minWebLabel": "最小弧厚",
		"mvLabel": "炮口初速",
		"nameFrm": "系统概览",
		"noDataMsg": "无效设计或数据",
		"nozzEffLabel": "喷管效率",
		"nozzEffText": "喷管效率。参照火箭理论的结果，选用合适的扩张角下，简单锥形喷管也可以达到95%的推进效率。考虑到真实喷管的磨损漏气情况，同时为达到快速再发射的目的，以使弹在膛内时少量前坐，出膛后少量后坐，引入喷管效率进行修正。一般无坐力炮该值取92%左右。",
		"nozzExpLabel": "喷管面积比",
		"nozzExpText": "   无坐力炮喷管的扩张系数，或喷管尾与喉部的面积比。结合无坐力条件可以确定喉口的截面积。\n   无坐力炮的喷管类似于火箭，其推力系数（喷管喷出口的动压相比燃气平均压强的放大比例）随扩张系数的提升而增大，但总体上收益是边缘递减的。更高的推力系数使满足无坐力条件所需的喉口面积减小，对于提高无坐力炮的内弹道效率有积极作用，但是降低了系统的机动性以及紧凑性，从总体设计上必须仔细考量得失。一般无坐力炮取2-4。",
		"opFrmLabel": "程序运算控制",
		"optLFText": "   求该装药量下，满足最大设计压强和出膛弹速的最小炮膛容积解。\n   最小膛容解下火药燃尽点常常接近或位于炮口。实际使用中，火药燃速容易受环境温度、批次生产药力差异、弹药装填条件影响，使得弹速的可重复性较差。这样的解一般适用于以直射为主的加农炮，坦克炮，反坦克炮；这些武器弹速差异对于精度影响有限。而对于主要进行间瞄射击的榴弹炮，或主要进行长距离射击的海炮，应适当延长身管。",
		"pPLabel": "最大压强",
		"pRatioDesc": "　           （压强比50）",
		"pTgtLabel": "设计膛压",
		"pTgtText": "设计最大空间平均压强",
		"paLabel": "最大加速",
		"parFrmLabel": "系统性能参数",
		"pdtarcLabel": "孔径弧厚比",
		"pdtarcText": "   设置火药药粒孔径对于弧厚的比例。\n   生产过程中，多孔火药一般是以粘稠悬浊液、胶体的形式，在压强下挤入黄铜模具翻模制造。火药中孔洞尺寸，形状由模具中的柱状突出物半径，截面形状，偏心率等决定。此外，火药具有一定的可塑性，因此拆模，包装，运输过程中的挤压形变，也会对于孔径产生一定影响。\n   标准的多孔火药中，该值一般取值在0.5到1之间。对于较长的柱状火药，该值可以取到1.33。",
		"peffLabel": "压电效率",
		"peffText": "火炮压电效率（γp）又称充满系数，是弹底平均压强（加速度）与弹底最大压强（加速度）的比值，该指标衡量火炮工作容积利用效率。",
		"perfLRText": "设置火药药粒的长径比。多孔火药长径比一般在1.82-3.57之间。该比例越大，火药燃烧增面性越强。当取值过小，以至于药粒柱高小于弧厚时，药粒可能出现减面燃烧的现象。一般而言较长的药粒难以同时着火，需要每隔一定间隔开槽。运动性越差，发射时停留在在膛底，作用压强越高。",
		"plotAvgP": "空间平均压强",
		"plotBaseP": "弹底压强",
		"plotBreechP": "膛底压强",
		"plotBurnup": "火药燃去比例",
		"plotEtaBld": "燃气流出比例",
		"plotEtaEsc": "燃气流出比例",
		"plotFrmLabel": "计算结果作图",
		"plotNozzleP": "药室底压强",
		"plotNozzleV": "喷管喉口流速",
		"plotRecoil": "后坐力",
		"plotStagP": "滞止点压强",
		"plotTab": "数据作图",
		"plotText": "考虑火药燃烧的弹后火药、气流运动实际情况较为复杂。经典内弹道解法中经常采取一些简化假设。首先，假设气相与固相运动速度一致，这样的流动称为均相流，在装药较为颗粒化时可以认为是近似成立的。其次，弹后气流的时间、空间分布以一定的前提假设简化，以便于为各参数取适当的平均值，作为常量，简化弹道计算。\n最为经典、常用的简化是拉格朗日（Lagrange）简化，即假设弹后气流密度均匀（∂ρ/∂x=0），可以推导出弹后气流流速随空间线性分布，气体压强随空间呈抛物线分布。毕杜克（Pidduck）则从气流膨胀是等熵（绝热可逆，∂S/∂x=0）过程出发，详细研究了火药燃尽后弹头起动引起的稀疏波系，在震荡快速衰减的极限下，以特解的形式得到了该假设下气流的极限分布，即流速随空间线性，压强随空间指数分布。马蒙陀夫（英文M.A.Mamontov，俄文M.A.Ма́монтов）解则从温度均匀的假设（∂T/∂x=0）出发，同样推导出了线性流速与指数压强，可以看作毕杜克解在绝热系数趋于1的极限。\n拉格朗日解的应用基础是建立在装药比等效弹重远小于1时，膛内压力扰动以压力波的形式，在膛底和弹底之间多次反射，压强分布在震荡的过程中趋于一致，其平均值接近该近似解计算值。在装药比提高时，弹头出膛前反射的压力波至多只有一次追上弹底的机会，膛内压强不太可能均匀，此时很难认为拉格朗日解成立。毕杜克考虑了压力波过程，极限解取于震荡衰减快，震荡阶段占比小的情况。在高装药比提高，火药燃速有限的情况下，燃烧不均匀加剧，压力波可能转化为激波，也不是严格适用的。对于更高装药比的情况，有一些观点认为虽然密度场的分布不一定均匀，但是温度场有可能，因此马蒙陀夫近似解可能更适合这种情况。\n实际上，三种近似解的结果十分接近，并且都很难表征高装药情况下的实际情况。高装药比情况下需要使用均相流或者两项流模型，同时计算时间、空间上气流情况，计算复杂度相比经典内弹道体系激增，而其结果在装药比<1时与经典内弹道模型差距不大。",
		"plotVel": "弹速",
		"pltOptnFrm": "作图控制",
		"ppLabel": "最大压强",
		"ppText": "分别记最大平均工作压强，及最大膛底压强。",
		"propFrmLabel": "火药参数",
		"reloadPropellant": "加载火药定义",
		"resetLabel": "重置设计",
		"sampText": "   采样时将给定域等间隔均分的数目。程序中，特征点的计算先行进行，与采样设置无关。采样点的计算在时间域上独立于特征点计算，可以用于特征点计算结果的验证。\n   需要注意的是，由于基于长度的常微分系统在零点上有数值奇点，因此在长度域上的采样点计算与特征点计算并不独立。",
		"sampleFrmLabel": "采样控制",
		"saveLabel": "保存设计",
		"savedLocMsg": "文件保存至",
		"segmentLabel": "结构分段",
		"sffLabel": "安全系数",
		"shtLabel": "弹重",
		"solFrmLabel": "内弹道气动梯度",
		"solLabel": "计算选项",
		"specFrmLabel": "内弹道参量",
		"specsText": "   单基火药一般由硝化纤维作为主要成分。硝化纤维溶入合适有机溶剂（如丙酮）分子结构变性，溶剂析出后燃速降低10^5倍，由爆炸转为燃烧（放热自分解），常见硝化比例从11-13%不等。还可加入少许稳定剂、塑化剂，提高化学稳定性，降低燃速爆温。其生产工艺成熟，成本可控，且具有良好的机械性能。\n   双基火药在硝化纤维为主的基础上，溶入相当比例的硝化甘油作为胶化剂，同时积极参与火药燃烧。在提高火药力以外还有改善燃烧产物化学平衡，减少发烟的作用。除硝化甘油外，亦有二甘醇二硝酸酯作为胶化剂的技术路线，可减少对硝化甘油生产所需的酒精的消耗。少量添加其他成分作稳定剂。双基火药更高的爆温也同时提高了燃气的侵蚀性，提高性能的同时，对系统寿命有消极影响。基于二甘醇二硝酸酯的双基火药挥发性更强，热稳定性更弱。\n   三基火药成分以硝基胍为主，硝化纤维与硝化甘油以一定比例溶解而成。硝基胍在燃烧中起到改善膛内欠氧状态，降低产物可燃物比例，起到在不提高爆温的前提下提高火药力的作用。与双基火药一样，同样可以采用其他胶化剂。三基火药通常机械性能欠佳，生产时需要低温缓慢挤出成型，膛内较高压强或冲击波条件下容易发生药粒碎裂的情况。此外，硝基胍合成流程较长，原材料成本较高，因此产量有限。因此，也有使用混合硝酸酯替代硝基胍，以降低造价，降低对特定原材料依赖的尝试。\n   硝胺火药以环三亚甲基三硝胺（亦称黑索金）为主，混溶一定比例的硝基火药制成。常规硝胺炸药药力高，研磨成微米微粒后燃烧速率与火药敏感性可控。基于环四亚甲基四硝胺（亦称奥托金）的硝铵火药药力更高，但燃烧表现不稳定。",
		"stepCMRLabel": "装药:弹重比增量",
		"stepLFLabel": "相对装填密度增量",
		"stepLabel": "采样点",
		"stpLabel": "挤进压强",
		"stpText": "   设置挤进压强。内弹道计算中常见的化简是认为在第一阶段，火药在弹后空间定容燃烧，直到克服挤进压强。此时，弹头瞬间完成挤进炮膛，与膛线结合，开始运动，火药燃烧进入由常微方程描述的第二阶段。因为该参量实际上反映的是弹道简化，因此物理意义并不十分明确。\n   历史上常用静压法测定挤进压强，即用压力机缓慢将弹头挤入膛线所需的最大静压。一般而言，对于大口径线膛炮10-20MPa，对小口径武器取30-40MPa。虽然较大的挤进压强一定程度上造成最大压强增加，但更高的挤进压强有利于改善点火条件，提高点火一致性，因此即便是滑膛炮也需要一定的挤进压强。\n   实际挤进是一个运动的过程，弹头在挤进过程中，膛压可达到最大膛压的六、七成，挤进完成时火药燃烧，弹头速度都达到出膛的一成左右，耗时大致是火药燃烧时间的四分之一到三分之一。\n   对无坐力火炮，为满足严格无坐力条件，喷口打开压强取挤进压强数值。",
		"stripRText": "设置带状火药长宽比。",
		"sucTitle": "成功",
		"swapLabel": "交换主副药",
		"tableTab": "数据打表",
		"tblFrmLabel": "计算结果打表",
		"tblLabel": "行程",
		"teffLabel": "热机效率",
		"teffText": "对于火药在膛内完全燃烧的情况，火炮热机效率(γg')是出膛瞬间火药气体温度（Tg），与火药恒容绝热火焰温度（T1）的函数，γg'=1-T/T1。热机功率联系了出膛速度（vg）与极限速度（vj），即vg=sqrt(γg')*vj。当Tg趋近于0时，出膛速度趋近于极限速度（vj）。",
		"themeLabel": "界面主题",
		"tolText": "   积分器最大允许误差，ε。龙格-库塔-菲尔伯格自适应积分器根据每一步各项的取值，导数，对常微分方程生成七阶，八阶两个估测。这两个估测的差值作为局部误差，再根据步长与积分域的比例外推，除以该点取值，估测全局相对误差。将该值与用户设定的误差大小作比较，按一定算法调整步长直到该条件得到满足。重复以上直到积分器达到停止条件，或遇到数值奇点。\n   鉴于实际积分的常微分系统采用归一化无量纲形式，各项取值为：速度［0，1），行程、时间［0，正无穷）。\n   默认取值为对应ε=1E-3，若特征值与采样点间出现跳变现象，或反算优化出现无法达到指标，提示需要提高精度计算。出于运算耗时的考虑，建议谨慎选取比默认值更高的精度限制。",
		"traceHull": "结构曲线",
		"tracePress": "压强曲线",
		"uncontained": "火药未燃尽",
		"useAuxGrainLabel": "混合装药",
		"useConsText": "根据设计最大压强与设计弹速，按照精度要求，反算满足条件的火药弧厚，行程。需要注意的是，反解虽然可以按任意数值精度进行，但计算的结果不一定具有实际应用价值。",
		"useMaterialLabel": "计算结构",
		"vTgtLabel": "设计弹速",
		"vaLabel": "极限弹速",
		"vacISPDesc": "　　真空比冲",
		"vinfText": "该装药条件下的极限速度（vj），即炮管长度趋于无穷时弹速的极限。正比与火药力与装药量的乘积的平方根，反比于弹重，绝热指数-1，与次要功系数的平方根。",
		"widthLabel": "宽度",
		"widthText": "设置带状火药宽度。"
	}
}